app/Controllers/Auth.php

SELECT *
FROM `usuario`
WHERE `correo` = '2@2.com'
 LIMIT 1
---
    public function attemptLogin()
    {
        log_message('debug', 'Accediendo a Auth::attemptLogin');
        $model = new UsuarioModel();
        $correo = trim($this->request->getPost('correo'));
        $password = $this->request->getPost('password');

        log_message('debug', 'Datos recibidos: correo=' . ($correo ?? 'null') . ', password=' . (empty($password) ? 'empty' : 'provided'));

        if (!$correo || !$password) {
            log_message('error', 'Correo o contraseña vacíos');
            session()->setFlashdata('error', 'Por favor, ingresa correo y contraseña.');
            return redirect()->back();
        }

        $user = $model->where('correo', $correo)->first();