app/Controllers/Tasks.php

SELECT *
FROM `tasks`
WHERE `user_id` = '3'
AND `is_archived` = 0
ORDER BY `title` ASC
---
    public function index()
    {
        log_message('debug', 'Accediendo a Tasks::index');
        $modelo = new TaskModel();
        $subtaskModelo = new SubtaskModel();
        $tareaCompartidaModelo = new TareaCompartidaModel();
        $usuarioModelo = new UsuarioModel();

        $userId = session()->get('user_id');
        log_message('debug', 'User ID en sesión: ' . ($userId ?? 'null'));

        if (!$userId) {
            log_message('error', 'No hay usuario logueado');
            session()->setFlashdata('error', 'Debes iniciar sesión para ver tus tareas.');
            return redirect()->to('login');
        }

        // Obtener correo del usuario logueado
        $correoLogueado = session()->get('correo') ?? '';
        log_message('debug', 'Correo logueado: ' . ($correoLogueado ?: 'vacío'));

        // Manejar ordenamiento
        $sortBy = $this->request->getGet('sort_by') ?: 'title';
        $sortOrder = $this->request->getGet('sort_order') ?: 'asc';
        $allowedSorts = ['title', 'priority', 'status', 'due_date', 'created_at'];
        $allowedOrders = ['asc', 'desc'];
        $sortBy = in_array($sortBy, $allowedSorts) ? $sortBy : 'title';
        $sortOrder = in_array($sortOrder, $allowedOrders) ? $sortOrder : 'asc';

        // Obtener tareas propias (no archivadas)
        $tareasPropias = $modelo->where('user_id', $userId)
                               ->where('is_archived', 0)
                               ->orderBy($sortBy, $sortOrder)
                               ->findAll();

SELECT `tasks`.*
FROM `tasks`
JOIN `tarea_compartida` ON `tarea_compartida`.`task_id` = `tasks`.`id`
WHERE `tarea_compartida`.`correo_colaborador` = '2@2.com'
AND `tasks`.`is_archived` = 0
ORDER BY `title` ASC
---
        // Obtener tareas compartidas (no archivadas)
        $correo = session()->get('correo') ?? '';
        log_message('debug', 'Correo en sesión: ' . ($correo ?: 'vacío'));
        $tareasCompartidas = $modelo->select('tasks.*')
                                   ->join('tarea_compartida', 'tarea_compartida.task_id = tasks.id')
                                   ->where('tarea_compartida.correo_colaborador', $correo)
                                   ->where('tasks.is_archived', 0)
                                   ->orderBy($sortBy, $sortOrder)
                                   ->findAll();

SELECT `correo`
FROM `usuario`
WHERE `usuario`.`id` = '3'
---
        foreach ($tareasPropias as $tarea) {
            $tarea['es_propia'] = true;
            // Obtener correo del dueño
            $usuario = $usuarioModelo->select('correo')->find($tarea['user_id']);

SELECT `correo`
FROM `usuario`
WHERE `usuario`.`id` = '6'
---
            if (!isset($taskIds[$tarea['id']])) {
                $tarea['es_propia'] = false;
                // Obtener correo del dueño
                $usuario = $usuarioModelo->select('correo')->find($tarea['user_id']);

SELECT *
FROM `subtasks`
WHERE `task_id` = '20'
SELECT COUNT(*) AS `numrows`
FROM `subtasks`
WHERE `task_id` = '20'
AND `is_completed` = 0
---

        // Añadir subtareas y verificar subtareas pendientes
        foreach ($tareas as &$tarea) {
            $tarea['subtasks'] = $subtaskModelo->where('task_id', $tarea['id'])->findAll();
            $tarea['has_incomplete_subtasks'] = $subtaskModelo->where('task_id', $tarea['id'])
                                                             ->where('is_completed', 0)
                                                             ->countAllResults() > 0;

SELECT *
FROM `tasks`
WHERE `user_id` = '3'
AND `is_archived` = 1
ORDER BY `title` ASC
---
    public function archived()
    {
        log_message('debug', 'Accediendo a Tasks::archived');
        $modelo = new TaskModel();
        $subtaskModelo = new SubtaskModel();
        $tareaCompartidaModelo = new TareaCompartidaModel();
        $usuarioModelo = new UsuarioModel();

        $userId = session()->get('user_id');
        log_message('debug', 'User ID en sesión: ' . ($userId ?? 'null'));

        if (!$userId) {
            log_message('error', 'No hay usuario logueado');
            session()->setFlashdata('error', 'Debes iniciar sesión para ver tus tareas archivadas.');
            return redirect()->to('login');
        }

        // Obtener correo del usuario logueado
        $correoLogueado = session()->get('correo') ?? '';
        log_message('debug', 'Correo logueado: ' . ($correoLogueado ?: 'vacío'));

        // Obtener tareas propias archivadas
        $tareasPropias = $modelo->where('user_id', $userId)
                               ->where('is_archived', 1)
                               ->orderBy('title', 'asc')
                               ->findAll();

SELECT `tasks`.*
FROM `tasks`
JOIN `tarea_compartida` ON `tarea_compartida`.`task_id` = `tasks`.`id`
WHERE `tarea_compartida`.`correo_colaborador` = '2@2.com'
AND `tasks`.`is_archived` = 1
ORDER BY `title` ASC
---
        // Obtener tareas compartidas archivadas
        $correo = session()->get('correo') ?? '';
        log_message('debug', 'Correo en sesión: ' . ($correo ?: 'vacío'));
        $tareasCompartidas = $modelo->select('tasks.*')
                                   ->join('tarea_compartida', 'tarea_compartida.task_id = tasks.id')
                                   ->where('tarea_compartida.correo_colaborador', $correo)
                                   ->where('tasks.is_archived', 1)
                                   ->orderBy('title', 'asc')
                                   ->findAll();

SELECT `correo`
FROM `usuario`
WHERE `usuario`.`id` = '3'
---

        foreach ($tareasPropias as $tarea) {
            $tarea['es_propia'] = true;
            $usuario = $usuarioModelo->select('correo')->find($tarea['user_id']);

SELECT `correo`
FROM `usuario`
WHERE `usuario`.`id` = '1'
---
        foreach ($tareasCompartidas as $tarea) {
            if (!isset($taskIds[$tarea['id']])) {
                $tarea['es_propia'] = false;
                $usuario = $usuarioModelo->select('correo')->find($tarea['user_id']);

SELECT *
FROM `subtasks`
WHERE `task_id` = '15'
---

        // Añadir subtareas
        foreach ($tareas as &$tarea) {
            $tarea['subtasks'] = $subtaskModelo->where('task_id', $tarea['id'])->findAll();

SELECT *
FROM `tasks`
WHERE `user_id` = '6'
AND `tasks`.`id` = '23'
SELECT COUNT(*) AS `numrows`
FROM `subtasks`
WHERE `task_id` = '23'
DELETE FROM `tasks`
WHERE `id` IN ('23')
---
    public function delete($id)
    {
        log_message('debug', 'Accediendo a Tasks::delete, id: ' . $id);
        $modelo = new TaskModel();
        $subtaskModelo = new SubtaskModel();
        $userId = session()->get('user_id');

        if (!$userId) {
            log_message('error', 'No hay usuario logueado');
            session()->setFlashdata('error', 'Debes iniciar sesión para eliminar tareas.');
            return redirect()->to('login');
        }

        $tarea = $modelo->where('user_id', $userId)->find($id);
        if (!$tarea) {
            log_message('error', 'Tarea no encontrada o no pertenece al usuario, id: ' . $id);
            session()->setFlashdata('error', 'Tarea no encontrada o no tienes permiso.');
            return redirect()->to('tasks');
        }

        // Verificar si la tarea tiene subtareas
        $subtaskCount = $subtaskModelo->where('task_id', $id)->countAllResults();
        if ($subtaskCount > 0) {
            log_message('error', 'No se puede eliminar la tarea porque tiene subtareas asociadas, id: ' . $id);
            session()->setFlashdata('error', 'No puedes eliminar esta tarea porque tiene subtareas asociadas.');
            return redirect()->to('tasks');
        }

        if ($modelo->delete($id)) {

SELECT *
FROM `tasks`
WHERE `user_id` = '6'
AND `tasks`.`id` = '22'
INSERT INTO `subtasks` (`task_id`, `title`, `is_completed`, `created_at`, `updated_at`) VALUES ('22', 'qqqqqqqqqq', 0, '2025-05-16 09:11:18', '2025-05-16 09:11:18')
---
    public function addSubtask($task_id)
    {
        log_message('debug', 'Accediendo a Tasks::addSubtask, task_id: ' . $task_id);
        $modelo = new TaskModel();
        $subtaskModelo = new SubtaskModel();
        $userId = session()->get('user_id');

        if (!$userId) {
            log_message('error', 'No hay usuario logueado');
            session()->setFlashdata('error', 'Debes iniciar sesión para añadir subtareas.');
            return redirect()->to('login');
        }

        $tarea = $modelo->where('user_id', $userId)->find($task_id);
        if (!$tarea) {
            log_message('error', 'Tarea no encontrada o no pertenece al usuario, task_id: ' . $task_id);
            session()->setFlashdata('error', 'Tarea no encontrada o no tienes permiso.');
            return redirect()->to('tasks');
        }

        $data = [
            'task_id' => $task_id,
            'title' => $this->request->getPost('subtask_title') ?: 'Subtarea',
            'is_completed' => 0
        ];

        if ($subtaskModelo->save($data)) {

SELECT *
FROM `subtasks`
WHERE `subtasks`.`id` = '18'
SELECT *
FROM `tasks`
WHERE `tasks`.`id` = '22'
SELECT *
FROM `tarea_compartida`
WHERE `task_id` = '22'
AND `correo_colaborador` = 'alf@gmail.com'
 LIMIT 1
---
    public function toggleSubtask($subtask_id)
    {
        log_message('debug', 'Accediendo a Tasks::toggleSubtask, subtask_id: ' . $subtask_id);
        $subtaskModelo = new SubtaskModel();
        $taskModelo = new TaskModel();
        $tareaCompartidaModelo = new TareaCompartidaModel();
        $userId = session()->get('user_id');

        if (!$userId) {
            log_message('error', 'No hay usuario logueado');
            session()->setFlashdata('error', 'Debes iniciar sesión para modificar subtareas.');
            return redirect()->to('login');
        }

        $subtask = $subtaskModelo->find($subtask_id);
        if (!$subtask) {
            log_message('error', 'Subtarea no encontrada, id: ' . $subtask_id);
            session()->setFlashdata('error', 'Subtarea no encontrada.');
            return redirect()->to('tasks');
        }

        // Verificar que el usuario es dueño o colaborador
        $tarea = $taskModelo->find($subtask['task_id']);
        $esPropia = $tarea['user_id'] == $userId;
        $esCompartida = $tareaCompartidaModelo->where('task_id', $subtask['task_id'])
                                             ->where('correo_colaborador', session()->get('correo'))
                                             ->first();

UPDATE `subtasks` SET `is_completed` = 1, `updated_at` = '2025-05-16 09:11:22'
WHERE `subtasks`.`id` IN ('18')
SELECT *
FROM `subtasks`
WHERE `subtasks`.`id` = '18'
---
        log_message('debug', 'Estado de subtarea antes de actualizar, subtask_id: ' . $subtask_id . ', is_completed: ' . $subtask['is_completed']);
        log_message('debug', 'Estado de tarea, task_id: ' . $subtask['task_id'] . ', status: ' . $tarea['status']);

        if ($subtaskModelo->update($subtask_id, $data)) {
            // Obtener la subtarea actualizada para confirmar el estado
            $updatedSubtask = $subtaskModelo->find($subtask_id);

UPDATE `tasks` SET `status` = 'in_progress', `updated_at` = '2025-05-16 09:11:22'
WHERE `tasks`.`id` IN ('22')
---
                $taskData = [
                    'status' => 'in_progress'
                ];
                $taskModelo->update($subtask['task_id'], $taskData);